{
    "1": {
        "urid": 1,
        "review": "It's not entry level friendly but can be very rewarding.. I struggled at first, boy it was challenging but with lots of practice and doing tutorials\/training I managed to not come in 12th or 10th place.. I now place at about 6th or 4th.. Boy does not wining  a race hurt but it's the grind and constant improvement.. Could lower the difficult and turn assist on but that would take the fun out of the challenge..I then went to YouTube to see pro gamers struggling or flipping cars as well so that made me feel a little better too..",
        "rating": 10,
        "userid": 7,
        "gameid": 5
    },
    "2": {
        "urid": 2,
        "review": "If your looking for a real rally experience buy Dirt. The handling on this game is cartoonish. You cut and you get penalties. Total garbage.",
        "rating": 2,
        "userid": 2,
        "gameid": 9
    },
    "3": {
        "urid": 3,
        "review": "Very detailed graphics, challenging driving, and numerous course selections. A lot of fun for multiplayer. The only semi con is that it is difficult to select changes to your driving car... but overall a must have.",
        "rating": 10,
        "userid": 10,
        "gameid": 10
    },
    "4": {
        "urid": 4,
        "review": "Simply gorgous to look at and play.  It says pure simulator on the box for a reason.  If you go in expecting anything less you will get plastasized.",
        "rating": 10,
        "userid": 4,
        "gameid": 10
    },
    "5": {
        "urid": 5,
        "review": "Good game, need to spend some more time playing it",
        "rating": 6,
        "userid": 9,
        "gameid": 1
    },
    "6": {
        "urid": 6,
        "review": "This is a good one. One of the best driving games I've played. The career mode is a bit of a pain but still pretty cool.",
        "rating": 10,
        "userid": 4,
        "gameid": 5
    },
    "7": {
        "urid": 7,
        "review": "The WRC 8 FIA World Rally Championship is a great game to play. The cars are awesome and the scenery is breathtaking. There's so much to do! I really have lots of fun playing it. Much improvement over the WRC 7 World Rally Championship. They did a really nice job in putting this game together.",
        "rating": 10,
        "userid": 7,
        "gameid": 3
    },
    "8": {
        "urid": 8,
        "review": "They exclusively sell these at GameStop only, which makes them more valuable.",
        "rating": 10,
        "userid": 5,
        "gameid": 9
    },
    "9": {
        "urid": 9,
        "review": "The graphics are pretty good...game is a little hard...but the batman costume is really lt...and the skills are good.",
        "rating": 10,
        "userid": 4,
        "gameid": 10
    },
    "10": {
        "urid": 10,
        "review": "I bought this last week because I had the third one and needed the first two. I was not disappointed when I bought them however I have the policy about the scratches and the first one Arkham asylum is scratched and at a certain point it stops working so yea. But nonetheless still great games!!",
        "rating": 10,
        "userid": 2,
        "gameid": 4
    },
    "11": {
        "urid": 11,
        "review": "I bought this bundle not knowing that it came with all of he dlc and to my surprise it came with it! They arr two of the best games of the last generation and they both won game of the year in their years respectivly.",
        "rating": 10,
        "userid": 2,
        "gameid": 9
    },
    "12": {
        "urid": 12,
        "review": "I'd like to be able to review the game, but GameStop sold me an unreadable disc. Unlike various other games that I got that would just freeze after getting to certain points where data was unreadable (Also very annoying), this game wouldn't even recognize as a game just Disc unreadable. Very disappointed.",
        "rating": 2,
        "userid": 9,
        "gameid": 10
    },
    "13": {
        "urid": 13,
        "review": "this game might be worth getting if your a simpsons fan. the graphics are pretty good and look like the tv series. however it is not a game i would recommend unless your a Simpsons Fan.. the dameplay is not the best. there are much better games out there based on gameplay. but Simpsons Fans should enjoy it",
        "rating": 6,
        "userid": 5,
        "gameid": 10
    },
    "14": {
        "urid": 14,
        "review": "I bought this as a gift for my sister so not sure what she thinks but she wanted it because we used to have it and it got lost or something.",
        "rating": 10,
        "userid": 6,
        "gameid": 3
    },
    "15": {
        "urid": 15,
        "review": "Bought the game and it works just fine but there is NO SOUND.",
        "rating": 2,
        "userid": 3,
        "gameid": 10
    },
    "16": {
        "urid": 16,
        "review": "The Gameplay for the Simpsons Game was Average, it took place in Springfield and the Cyber World. In my opinion there was not enough Springfield, you were mostly in a cyber world the whole game. There was a good chunk of the game that happened in different video game worlds that just made the story poor. Other then that the game was awesome, it was fun and if your a huge Simpsons Fan (Like Me) you would enjoy it a lot. Also the game never gets old weather you play it now or in 10 years. IT WILL NEVER GET OLD. It is a average game but not enough Springfield.",
        "rating": 8,
        "userid": 9,
        "gameid": 5
    },
    "17": {
        "urid": 17,
        "review": "This game is alright. I am a new fan of the show. I tried the game and it was pretty hard. The controls were very awkward in my mind. This is not the best game.",
        "rating": 8,
        "userid": 4,
        "gameid": 8
    },
    "18": {
        "urid": 18,
        "review": "This game is awesome it is so fun and crazy which games are not like any more. there is so many people that want games like assassin creed and fps and I'm sick of it I love how silly this game is yet creative and its fun also it has split screen co op which is the best when friends are over or if you have siblings It is short but it is repetitive great buy",
        "rating": 10,
        "userid": 8,
        "gameid": 4
    },
    "19": {
        "urid": 19,
        "review": "good but not the best there are others games this can be a kids game but its fun to play .....................",
        "rating": 8,
        "userid": 9,
        "gameid": 6
    },
    "20": {
        "urid": 20,
        "review": "i like the game had co op and i like some of the features you had but it can get complicated if you do not look up what you are suppose to do i like that the game had the perfect visuals it was almost like you are one of the simpson's i dont like that the game can be more like a puzzle then i am used to all in all it was not a bad little game",
        "rating": 8,
        "userid": 5,
        "gameid": 2
    },
    "21": {
        "urid": 21,
        "review": "Its really cool but short. its the kind of game you rent but still cool.",
        "rating": 8,
        "userid": 3,
        "gameid": 3
    },
    "22": {
        "urid": 22,
        "review": "I've played this game a lot of this game, and the truth of this game is that it has good graphics, if you're with a friend can spend the game in cooperative, fully recommend this game because you play while you have so much fun. I recommend this game to fans of The Simpsons too.",
        "rating": 8,
        "userid": 8,
        "gameid": 9
    },
    "23": {
        "urid": 23,
        "review": "I like the game alot but i cant play online because i downloaded it from ebgames.com so i dont have a cd key so i cant play online. But the game is challenging, it gives you a feeling of how intense WW 2 was, and you get an incredibly sweet feeling when you falnk the enemy and finish them. The story is awsome because it shows it from another perspective. It tells you alot about your charecter. Joe Hartsock or \"Red\" is a careing squad leader who would do anything just to get his men home in one piece. But he realizes that he cant save anyone so he thinks he's there to shorten the casualties. You have to take your men are part of the legendary 101st Airborne. You'll need tactical excellence to get through this game. But you also need to care for your men because you will need them to help you and if they die you have no chance so keep them alive!",
        "rating": 10,
        "userid": 2,
        "gameid": 8
    },
    "24": {
        "urid": 24,
        "review": "Pre-order process was very easy and smooth, and I am very excited to play this when it comes out!!",
        "rating": 10,
        "userid": 6,
        "gameid": 3
    },
    "25": {
        "urid": 25,
        "review": "My girl loved the game man she is up early right now playing it again thanks a lot",
        "rating": 10,
        "userid": 2,
        "gameid": 6
    },
    "26": {
        "urid": 26,
        "review": "My son is a big Michael Jackson fan and has really enjoyed playing this game!",
        "rating": 10,
        "userid": 4,
        "gameid": 8
    },
    "27": {
        "urid": 27,
        "review": "It didn't work  I just tried it yesterday   I'm sure the game is great I used to have. It years ago but the disc would  not play in either wii",
        "rating": 2,
        "userid": 2,
        "gameid": 1
    },
    "28": {
        "urid": 28,
        "review": "Of course the songs are great and the dances are awesome",
        "rating": 10,
        "userid": 6,
        "gameid": 3
    },
    "29": {
        "urid": 29,
        "review": "My son and neighbors absolutely love dancing along to this game. There are a bunch of songs and dancing levels from which to choose.  Ordering it through gamestop was easy, and the product is in great condition.",
        "rating": 10,
        "userid": 3,
        "gameid": 10
    },
    "30": {
        "urid": 30,
        "review": "One of the best games ever made wish they remake it",
        "rating": 10,
        "userid": 10,
        "gameid": 9
    },
    "31": {
        "urid": 31,
        "review": "I can't rate it yet. I actually put this gift in the back of the closet and forgot about it. It was supposed to be a Christmas gift. Oh my goodness, I know she will love it!",
        "rating": 2,
        "userid": 5,
        "gameid": 8
    },
    "32": {
        "urid": 32,
        "review": "I like the Michael Jackson the Experience Wii game. It's so much fun.",
        "rating": 10,
        "userid": 8,
        "gameid": 3
    },
    "33": {
        "urid": 33,
        "review": "I love micheal jackson and still listen to him till this day. This game is exactly like just dance but strictly micheal jackson songs.It even includes tutorials by dancers on the songs and moves micheal jackson did. overall, 10\/10",
        "rating": 10,
        "userid": 3,
        "gameid": 6
    },
    "34": {
        "urid": 34,
        "review": "I bought Michael Jackson The experience preowned online and the disk wouldn't read. I cant return and get my money back at the store they say it has to be store credit.",
        "rating": 2,
        "userid": 10,
        "gameid": 6
    },
    "35": {
        "urid": 35,
        "review": "I bought this on April 13,2020 after not playing since I was 11 in 2011 and it's still fun amazing I love it",
        "rating": 10,
        "userid": 9,
        "gameid": 3
    },
    "36": {
        "urid": 36,
        "review": "My family and i love it. Makes family night fun and its a free workout no gym needed.",
        "rating": 10,
        "userid": 9,
        "gameid": 7
    },
    "37": {
        "urid": 37,
        "review": "It does not work. I have to take it back to the store and get a replacement. I have been working haven't had a chance to do so.",
        "rating": 2,
        "userid": 5,
        "gameid": 6
    },
    "38": {
        "urid": 38,
        "review": "I cant play it. I cant even enjoy the experience. I bought it for my kids bday and they can't even play it",
        "rating": 2,
        "userid": 6,
        "gameid": 3
    },
    "39": {
        "urid": 39,
        "review": "As You Know Michael Jackson Died in 2009 That's Why I Got This Game",
        "rating": 10,
        "userid": 9,
        "gameid": 6
    },
    "40": {
        "urid": 40,
        "review": "i got the game and it was scratched and it did not work",
        "rating": 2,
        "userid": 4,
        "gameid": 9
    },
    "41": {
        "urid": 41,
        "review": "Great game for the family. Since I bought it the family  has been playing it together ever since",
        "rating": 8,
        "userid": 7,
        "gameid": 1
    },
    "42": {
        "urid": 42,
        "review": "Love mj love the song selection. Highly recommended",
        "rating": 10,
        "userid": 4,
        "gameid": 5
    },
    "43": {
        "urid": 43,
        "review": "This is a good game I played it and the game is great for learning how to dance like him like the moonwalk",
        "rating": 10,
        "userid": 4,
        "gameid": 4
    },
    "44": {
        "urid": 44,
        "review": "Amazing Game Me And My Niece Plays Everyday After School She Loves It And I Love It Way More",
        "rating": 10,
        "userid": 7,
        "gameid": 6
    },
    "45": {
        "urid": 45,
        "review": "I really enjoyed this game. It helps me keep moving.",
        "rating": 10,
        "userid": 2,
        "gameid": 3
    },
    "46": {
        "urid": 46,
        "review": "To be perfectly honest with you all, my children play this game everyday. It's awesome. And worth every penny every time I purchase. The greatest entertainer ever to grace this Earth will continue to entertain!",
        "rating": 10,
        "userid": 6,
        "gameid": 3
    },
    "47": {
        "urid": 47,
        "review": "I bought this recently and me and my family love this game!!",
        "rating": 10,
        "userid": 6,
        "gameid": 8
    },
    "48": {
        "urid": 48,
        "review": "My family has played this game everyday since I bought it. Even my teenage kids. Great for family time also a light workout.",
        "rating": 10,
        "userid": 6,
        "gameid": 3
    },
    "49": {
        "urid": 49,
        "review": "I bought this about 2 weeks ago and me and the kids love it.. I'm a huge MJ fan anyway so this was great.",
        "rating": 10,
        "userid": 5,
        "gameid": 7
    },
    "50": {
        "urid": 50,
        "review": "Great game that my family enjoys and loves very much!",
        "rating": 10,
        "userid": 2,
        "gameid": 7
    },
    "51": {
        "urid": 51,
        "review": "Very fun with one player or four. Would have liked more songs, but overall it is a great game.",
        "rating": 10,
        "userid": 5,
        "gameid": 8
    },
    "52": {
        "urid": 52,
        "review": "Game only partly works. Some of the songs and features don't work.",
        "rating": 6,
        "userid": 8,
        "gameid": 10
    },
    "53": {
        "urid": 53,
        "review": "My girls love it.... a bit pricey for a older game but no complains",
        "rating": 10,
        "userid": 5,
        "gameid": 7
    },
    "54": {
        "urid": 54,
        "review": "Bought this game three times! I love it, kids love it even more!",
        "rating": 10,
        "userid": 8,
        "gameid": 1
    },
    "55": {
        "urid": 55,
        "review": "Liked this game since the release date. Had to repurchase!",
        "rating": 10,
        "userid": 5,
        "gameid": 5
    },
    "56": {
        "urid": 56,
        "review": "My 9 year olds love this. They have discovered iconic Michael Jackson music & dance, and we could not find this 2010 game anywhere but here. The graphics are definitely not the same level as a 2018 game but we appreciate being able to still get this great Wii game. I hope Wii comes out with a 2018\/19 version soon!",
        "rating": 10,
        "userid": 6,
        "gameid": 1
    },
    "57": {
        "urid": 57,
        "review": "I bought the game on line for my son and an error comes up when installing",
        "rating": 2,
        "userid": 5,
        "gameid": 3
    },
    "58": {
        "urid": 58,
        "review": "This is the best dancing game ever. Due to the fact that it is based on Michael Jackson, the artist with the highest selling album in the world \"Thriller\" (1982). It has all of Jackson's greatest hits with his iconic dance moves. I would recommend this to all Michael Jackson fans and dancing game fans.",
        "rating": 8,
        "userid": 2,
        "gameid": 4
    },
    "59": {
        "urid": 59,
        "review": "The game itself is good if you're a big Micheal Jackson fan. The dance moves are usually the same as in the videos, also you can unlock little dance videos from MJ's choreographers, or people who just downright danced for the game. What I always find funny is looking at the legs of the in game dancers because those were videotaped with photoshopped glow around it. What I honestly dislike is, even if you do get the gold move the game won't recognize it. As well as the fact that in general the choreography is pretty hard. Over all an ok game.",
        "rating": 6,
        "userid": 7,
        "gameid": 7
    },
    "60": {
        "urid": 60,
        "review": "ITS A GREAT GAME TO DANCE TO BY LEARNING THE ACTUAL MOVES LIKE MICHAEL JACKSON. HAD SO MUCH FUN DANCING TO THE GAME.",
        "rating": 10,
        "userid": 5,
        "gameid": 5
    },
    "61": {
        "urid": 61,
        "review": "i love this game it is actually like a good work out you just don't know you're doing it lmao but i think this game rocks on",
        "rating": 10,
        "userid": 4,
        "gameid": 3
    },
    "62": {
        "urid": 62,
        "review": "I agree with Duymus from Melbourne, FL = This game is no Fun and a Waste of time. I owned it like twice and This game and I just don't get along. For one thing, Whenever I'd play it in my Room, I don't have enough room in My Bedroom to dance to it. So This game totally Bites.",
        "rating": 4,
        "userid": 4,
        "gameid": 5
    },
    "63": {
        "urid": 63,
        "review": "I BOUGHT THIS GAME BECAUSE OTHER REVIEWS SAID IT WAS A GOOD WORKOUT. IF YOU ACTUALLY MOVE YOUR BODY AND NOT JUST YOUR ARMS AND GET INTO THE DANCING YOU WILL DEFINITELY BREAK A SWEAT AND GET A WORKOUT. WARNING ABOUT THE GAME THOUGH, YOU SHOULD DEFINITELY PLAY IN A WIDE OPEN AREA WITH HIGH CEILINGS. GREAT BUY!",
        "rating": 8,
        "userid": 8,
        "gameid": 1
    },
    "64": {
        "urid": 64,
        "review": "I love this game! It's so much fun learning how to move just like him after watching his videos for so many years. Even my daughter tried it and she is 6.",
        "rating": 10,
        "userid": 8,
        "gameid": 8
    },
    "65": {
        "urid": 65,
        "review": "Awesome with a group of people for a party also great for lowering the fat bulge areas.",
        "rating": 8,
        "userid": 5,
        "gameid": 6
    },
    "66": {
        "urid": 66,
        "review": "This game is an awesome party game to play. If you buy it you'll like it and it will turn into to love it. After a while that you've played it it'll start to get a little boring and you'll move on, but one day you'll look back at all your games and say I miss this game and then you'll play it like you first got it again.",
        "rating": 8,
        "userid": 10,
        "gameid": 2
    },
    "67": {
        "urid": 67,
        "review": "This is the most amazing game I have ever played in my entire life, those of you that haven't played this need to. It is the most amazing experience you may ever have. :O",
        "rating": 10,
        "userid": 8,
        "gameid": 2
    },
    "68": {
        "urid": 68,
        "review": "AWESOME GAME!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! GET IT!!!!!!!!!!!!!!!1111",
        "rating": 10,
        "userid": 3,
        "gameid": 3
    },
    "69": {
        "urid": 69,
        "review": "It is a great game for fans and it has every one of his best songs that topped the charts. But the gameplay is a little harder than Just Dance.",
        "rating": 10,
        "userid": 10,
        "gameid": 3
    },
    "70": {
        "urid": 70,
        "review": "This game is just amazing to say the least its perfect for all age groups and types of gamers. After playing this game i will never pick up and just dance game. If you haven't tried Michael Jackson the Experience your missing out and you should give it a go you won't be dissapointed!",
        "rating": 10,
        "userid": 8,
        "gameid": 5
    },
    "71": {
        "urid": 71,
        "review": "I PURCHASED MICHAEL JACKSON THE EXPERIENCE FRIDAY AFTER WORK AND LET ME TELL YOU IT IS WONDERFUL. MY DAUGHTER AND I STARTED PLAYING AS SOON AS I GOT HOME AFTER FIVE WE HAD SO MUCH FUN ,IT WAS AFTER THREE O CLOCK THAT MORNING WHEN WE DECIDED TO STOP PLAYING AND GO TO BED .THANK YOU SO MUCH FOR THIS GAME.",
        "rating": 10,
        "userid": 7,
        "gameid": 7
    },
    "72": {
        "urid": 72,
        "review": "cool game!!!!!Michael Jackson ROCK!!!!!!!!!!!!!!!!!!!!!!!!",
        "rating": 10,
        "userid": 4,
        "gameid": 3
    },
    "73": {
        "urid": 73,
        "review": "This was the most awesome game I ever played in my life!!!! It's fun and great exercise! Great for MJ fans!",
        "rating": 10,
        "userid": 6,
        "gameid": 10
    },
    "74": {
        "urid": 74,
        "review": "This game is great for party gamers and it's great for whoever likes micheal jackson. I love this game and I hope they come out with a 2nd version of the wii!",
        "rating": 10,
        "userid": 6,
        "gameid": 10
    },
    "75": {
        "urid": 75,
        "review": "i love this game its perfect for everybody i do it by myself to and with my gf and i do smooth crinmal like no bodys buisness heeeee heeeee",
        "rating": 10,
        "userid": 8,
        "gameid": 7
    },
    "76": {
        "urid": 76,
        "review": "I really love this game.Its very fun, when we have parties we play it",
        "rating": 10,
        "userid": 5,
        "gameid": 4
    },
    "77": {
        "urid": 77,
        "review": "I received this game as a Christmas gift. I swear, it is the best money my friend ever spent on me!! I play a few times a week as a great exercise routine. I haven't gotten my husband to do try it yet, but I keep trying. I took it to a friends to just try and she bought one about a week later. Then she calls and has me come over and play so she can kick my butt!! Didn't happen, she only won two, but it was so much fun it didn't really matter!! Any one who likes Michael Jackson songs, will love this game!! Highly recommended!!",
        "rating": 10,
        "userid": 9,
        "gameid": 2
    },
    "78": {
        "urid": 78,
        "review": "My grandkids brought this game over to play. We had fun with it and I got hooked. Had to go out and buy my own. With all the different moves and variety of songs, it provides a good workout for me. I'm loving it!",
        "rating": 10,
        "userid": 3,
        "gameid": 4
    },
    "79": {
        "urid": 79,
        "review": "I love this game. My 2 year old plays this game and he does very well with it. All my friends love this game when they come over. I can't wait for them to come out with the 2nd version of the game!",
        "rating": 8,
        "userid": 5,
        "gameid": 2
    },
    "80": {
        "urid": 80,
        "review": "I really like this game. Very fun. I wanted this game since it was released. Got it after the price drop. Good decision.",
        "rating": 10,
        "userid": 5,
        "gameid": 9
    },
    "81": {
        "urid": 81,
        "review": "Very addictive especially if you are a true MJ fan but wish more songs were on the game (just being a little greedy)!",
        "rating": 8,
        "userid": 5,
        "gameid": 7
    },
    "82": {
        "urid": 82,
        "review": "I played it at a friends house for the first time about a month ago. I havent been able to get it off my mind since. I received it as a birthday gift and now im use it more than expected. Its a great game when entertaining a small group of guest or even by yourself. I hope they consider a part II with more songs. For the most part I highly recommend this game. Enjoy!",
        "rating": 10,
        "userid": 2,
        "gameid": 8
    },
    "83": {
        "urid": 83,
        "review": "this game is very because the game has all of mikeal jacksonhit songs on it",
        "rating": 10,
        "userid": 8,
        "gameid": 7
    },
    "84": {
        "urid": 84,
        "review": "This game is totally awesome! Not only do you get to dance to some of MJ's greatest hits, but you also get the workout of a lifetime. His moves are legendary!",
        "rating": 10,
        "userid": 4,
        "gameid": 8
    },
    "85": {
        "urid": 85,
        "review": "Game is great historical ww1 shooter. A lot of free dlc was given to the players and the game has great gamplay and beautiful graphics.",
        "rating": 10,
        "userid": 7,
        "gameid": 9
    },
    "86": {
        "urid": 86,
        "review": "It is not a good game..................................................................",
        "rating": 2,
        "userid": 9,
        "gameid": 10
    },
    "87": {
        "urid": 87,
        "review": "THE BEST BATTLEFIELD EVER AND WANTED TO GET IT FOR MY PC AND WANTED TO PLAY IT SO BAD",
        "rating": 10,
        "userid": 5,
        "gameid": 3
    },
    "88": {
        "urid": 88,
        "review": "I'm mainly writing this to help the games review on Gamestop... But it doesn't deserve a 3.7 that it's listed at. If you like shooters, and HUGE maps, lots of sniping space, vehicles, 40 players and great graphics.. Stop wasting time and start downloading this game. My only downside to it really is the download size... It's enormous ~50GB.",
        "rating": 8,
        "userid": 2,
        "gameid": 3
    },
    "89": {
        "urid": 89,
        "review": "This game is probably one of the most realistic FPS I've played. The game play is amazing, not to mention a history lesson. The game is intense. When you put a good gaming headset on you can hear the bullets wizzing by, its pretty crazy. Online play is intense and fast paced, the multipul arrays of vehicle choices and different weapons make for a game that keeps on giving.",
        "rating": 10,
        "userid": 5,
        "gameid": 10
    },
    "90": {
        "urid": 90,
        "review": "Battlefield has strayed from what made it great, and is now turning into the pile of garbage known as Call of Duty. If you want a good WW1 game get Verdun. It's cheaper and actually realistic. Absolutely 0 lasting appeal. No desire to play this at all.",
        "rating": 4,
        "userid": 3,
        "gameid": 6
    },
    "91": {
        "urid": 91,
        "review": "The overall concept of the game is good; I do like how the game comes with new features like the bayonet charge. I also like the options of a vehicle having the capability of holding a lot of people. What I do not like is the game is full of glitches. This is not a well-polished game at all. It leaves a lot to be desired. If you have a FPS that you already like and know this may not be a good choice for you. The vehicles being able to carry multiple passengers are the only good feature about them. The viewing angles are awful and while this might be historically correct is does not make for good game play. Shotguns are ridiculously over powered! People one shot from halfway across the map as well as handgun sniping seems to be happening too. I don't know if this a cheating issue or a skill issue. The last point I would make is that all the servers have very low Tic counts. This can make for some very short games. More load time then actual play time. I would only recommend this game if you are looking for a game that takes place during this time period or you would want a FPS while not having one that is current.",
        "rating": 4,
        "userid": 4,
        "gameid": 9
    },
    "92": {
        "urid": 92,
        "review": "With the game barely coming out it is in fair quality, the game has amazing rendering, graphics, and sound environments. The games campaign is quite an experience with action packed scenes and thought out storyline. The playstyle is similar to bf3 and 4 but has some really outstanding additions to the game. The only bad part that is standing because it was just released... The multiplayer is not balanced, I feel as though the game gives you the WORST weapons to start off with; It's understandable to give beginners OK weapons but the ones you receive are absolute garbage. Also at the moment some of the aiming for non single fire\/ Bolt action is slightly off, missing shots when you know you hit them. (It is not any connection problems or game lag that is affecting my biased opinion as I have an amazing computer and 45 or so Ping.)",
        "rating": 6,
        "userid": 10,
        "gameid": 5
    },
    "93": {
        "urid": 93,
        "review": "The game is fun and it makes you want to keep playing for a higher score. I gave it a 8 on game play because sometimes it don't pick up on your move even when you are right. The remote has to be held in the right position. I have a wii, it might be better on xbox 360 with the kinect. Also the facial graphics are a little blurred but i guess his body movement is the important part of the game. Overall if not for the little things, I'd give it a 20.",
        "rating": 8,
        "userid": 8,
        "gameid": 8
    },
    "94": {
        "urid": 94,
        "review": "Though MJ has passed away this game will always keep him in our memories.",
        "rating": 10,
        "userid": 6,
        "gameid": 4
    },
    "95": {
        "urid": 95,
        "review": "I bought this game because I love Michael Jackson and I fell in love with this game...I had a baby 14 months ago and was having a hard time losing weight, I lost 6 inches since Christmas dancing with this game. You can just stand there and move the controller and get perfects, but what fun is that?!!!!!...Excellent work out...my kids and I enjoy playing this game daily...Quick warning, if you have not danced or moved, I suggest you stretch beforehand or you will be very sore the next day.",
        "rating": 10,
        "userid": 6,
        "gameid": 2
    },
    "96": {
        "urid": 96,
        "review": "the game is awesome with the graphics and everything",
        "rating": 10,
        "userid": 6,
        "gameid": 8
    },
    "97": {
        "urid": 97,
        "review": "an excellent game, and it's well worth your time and money.",
        "rating": 10,
        "userid": 4,
        "gameid": 7
    },
    "98": {
        "urid": 98,
        "review": "this game is loads of fun perfect for partys.it takes a while to get used to so it is a little hard at first. you have the option of following along with michale or following along with the backround dancers. they have a whole bunch of his hit songs and the lyrics on the allows you to sing along. i love this game its perfect for any MJ fan",
        "rating": 10,
        "userid": 8,
        "gameid": 8
    },
    "99": {
        "urid": 99,
        "review": "What a great game. Last year my 6 yr old son did a MJ dance to \"Beat It\" for my 40th bd, I didn't know he know who MJ was. It was the best present for my b-day. I got this game for him for x-mas and we had a ball all night long. We then had a party with other family members and we battled to see who was the best MJ. Game game for families to get together and have some fun.",
        "rating": 10,
        "userid": 3,
        "gameid": 4
    },
    "100": {
        "urid": 100,
        "review": "I grew up a Micheal Jackson fan and so are my children. We all love playing this game together. Actually we spent New Year's Eve Playing all night I \/ We love this game.",
        "rating": 10,
        "userid": 6,
        "gameid": 5
    },
    "101": {
        "urid": 101,
        "review": "I bought this game and was ready to go all out but it has disappointed me with some songs because they suck and gets really boring and really i think there are about 3-5 good songs that's it, so that's why i think its OK but don't plan on keeping it.\r\n\r\nI would highly recommend just dance 1 and 2 these games are great and i love it.",
        "rating": 8,
        "userid": 6,
        "gameid": 5
    },
    "102": {
        "urid": 102,
        "review": "This game is great for all. If you want to work your butt off and \"attempt\" to dance like Michael or his background dancers then this is a great game. I have shook everything I got and had a blast playing this game. It only took me a second to realize I am no Michael Jackson(lol). I am determined to master Dirty Diana and The Way You Make Me Feel! Awesome, Awesome, Awesome, Game!",
        "rating": 10,
        "userid": 3,
        "gameid": 1
    },
    "103": {
        "urid": 103,
        "review": "you neded this game shop now this game this game is asome",
        "rating": 10,
        "userid": 7,
        "gameid": 7
    },
    "104": {
        "urid": 104,
        "review": "My sister got this game for Christmas and brought it up to my house. We had my whole family playing it. It was so much fun. I had to go out and buy my own so I could play it more. This game is a lot of fun. There are a lot of songs however I wish there were more, or at least be able to unlock songs. If you can unlock songs then I just haven't yet. Yes sometimes you have to ask which one is Michael, but hey they did their best. It is a great game and will give you a work out.",
        "rating": 8,
        "userid": 3,
        "gameid": 2
    },
    "105": {
        "urid": 105,
        "review": "Micheal Jackson the experience is the best dance\/workout game ever. It is very fun at parties. Also it is E for everyone which is also great. the graphics are tremendous, most songs look a lot like his videos.",
        "rating": 10,
        "userid": 6,
        "gameid": 7
    },
    "106": {
        "urid": 106,
        "review": "I picked this game up just for the heck of it yesterday and let me tell you that my family and I were hugely disappointed in the approach used to make it! Even my kids were not very interested in it after very long! The whole game and everything about it is flawed. My whole family is hugely into Michael Jackson and if he was still alive to see this horrible game he'd sue the heck out of UbiSoft for trying to attach his name to it just for it not meeting his expectations alone! It does have alot of songs which is nice and yes they are his but whats so annoyingly awful about the about the whole thing is that the character is more like a cartoony silhouette that was mapped over someone whom only knew half of Michael Jackson's Moves. The MJ Training Videos are only like 10 seconds long and tell you absolutely nothing that you didn't know before! The dancing part is focused more on your hands which is understandable because of the Wii Remote but that is still no excuse for the Lousy Dancing used in the game because everybody knows that Michael was always about fancy-footwork! Alot of the dancing doesn't even match the original dancing done by Michael and appears like somebody just winged it pretending to be him simply because they got paid to do so. The game is just a huge wasted effort! This is NOT a game I would recommend to anyone and neither would Michael Jackson himself. Anyone that truely adores him should steer clear of this horrible waste of time game that attempts to take on Michael's Name because it simply isn't even worthy enough of it and don't even get me started on the Kinect Version, it's even worse!",
        "rating": 4,
        "userid": 5,
        "gameid": 5
    },
    "107": {
        "urid": 107,
        "review": "Ok when i saw the commercial for this game I was like, who would play that dumb game.(Im a big MJ Fan tho) So anyways my cousins got the game when I went over their house that weekend. So I played the game and I was HOOKED! We played for 5 hours. It is so fun! Especially with other people. I got the game for Christmas and ever since I i opened it ive been playing it. It is so fun. The only thing is make sure you have a big area to play because they will not count the moves or you can get and ok intsead of and excellent. My best is Thriller. I got 5 stars and an 11465!!!!!!! Get at me lol!!!!!",
        "rating": 10,
        "userid": 5,
        "gameid": 1
    },
    "108": {
        "urid": 108,
        "review": "Hours of family fun. It will keep a party going on for hours. Definitely worth the price.",
        "rating": 10,
        "userid": 3,
        "gameid": 5
    },
    "109": {
        "urid": 109,
        "review": "This is a fun and great game to play with everyone. For Parties, Get Togethers and play only. It is a work out but a great game. The best game for 2010. Hope they make another one.",
        "rating": 10,
        "userid": 7,
        "gameid": 2
    },
    "110": {
        "urid": 110,
        "review": "They done a great job on the moves for MJ just like in his videos and u have to be just like Micheal learn all his moves just like ur really him",
        "rating": 10,
        "userid": 2,
        "gameid": 1
    },
    "111": {
        "urid": 111,
        "review": "I bought this for my wife for Christmas 2010. She is a HUGE MJ fan. This has all the songs you could want . Great looking graphics on the Wii. She has been dancing since she opened it 8 hours ago. We haven't played Wii in months. I think this did it for her.! Thanks Ubisoft. Now i can get another big screen for me and play my games!",
        "rating": 10,
        "userid": 9,
        "gameid": 9
    },
    "112": {
        "urid": 112,
        "review": "This game is the first movement game I have played and the best by far, I did not even know I was sweating because I mean't to do every move right. And it is a riot, because people get their \"dance look\" and are determined to do the right move, hilarious!!!!!!!!!!!!This is one the entire family can enjoy, but get an extra copy for the kids folks!",
        "rating": 10,
        "userid": 7,
        "gameid": 8
    },
    "113": {
        "urid": 113,
        "review": "Bought this primarily for my 5 year old son.....he loves Michael Jackson. He loves it, I love it, and so does my daughter (7 years old). It can be difficult to do some of the moves, but the kids thoroughly enjoy this game. It's also a great workout!!!",
        "rating": 8,
        "userid": 9,
        "gameid": 10
    },
    "114": {
        "urid": 114,
        "review": "This game go hard best dancing game ever i will keep this game.",
        "rating": 10,
        "userid": 8,
        "gameid": 7
    },
    "115": {
        "urid": 115,
        "review": "It is easy to play and a good workout! The song selection is great. There is music for every MJ fan.",
        "rating": 10,
        "userid": 2,
        "gameid": 5
    },
    "116": {
        "urid": 116,
        "review": "This game I bought it for my girlfriend. She loves MJ.. Im not that much of a dance game fan.. But this game i have to say is a lot of fun. The music is good. But some of the moves are a little too hard. I recommend this game to people that like dance games and mj music..",
        "rating": 8,
        "userid": 8,
        "gameid": 2
    },
    "117": {
        "urid": 117,
        "review": "This game is awesome in so many ways. Sure does make you sweat though if you really get into it. Only reason I gave the gameplay a 9 is because it's hard lol. MJ is not easy to mimic lol... But his song choice is nice..Love the different options, some songs you can be MJ himself or you can be the backup dancer, some songs are Duo's, again you have a choice who you want to be. I have to say my favourite MJ song is beat it and I totally rock the dance for that song!\r\nIf you are a huge MJ fan this game is for you. I been a huge MJ fan since I was a kid and can totally appreciate this game and what it's worth.",
        "rating": 10,
        "userid": 5,
        "gameid": 9
    },
    "118": {
        "urid": 118,
        "review": "We brought this game home with our Wii -- it was one of the two games that made the family decide to even get that console! -- and popped it in pretty quickly. After dancing to one song, even my mother, who truly isn't a fan of video games in any shape or form except for the occasional arcade-style game, wanted to play. We managed to spend almost three hours just having sheer FUN with this, trying out the songs, dancing along, singing, whatever.\r\n\r\nIt has to be, as the review \"title\" says, the most fun any of us has had in who knows how long. Mom says that even when she used to dance at bars with my dad on the weekends, from the time it opened to the time it closed, it wasn't near as much as this, and I think I can compare it to my box-playing days, back when leaves were the big thing, you know? It's a great family game, lyrics and song content somewhat aside, and as long as you can have fun? You barely even realize that you're getting tired. Dancing like this is some of the best exercise available, I think, and if the Just Dance games are anything at all CLOSE to this, we'll be picking them up as soon as possible. It's probably the best investment we've made for the family in some time, and that's saying something. If we could give it a score higher than ten, we would.\r\n\r\nOn a more detailed note, the game reads the controllers surprisingly well -- you truly have to have fun dancing, you can't just move your arms; it reacts to your overall motion, which I've heard some dance games fail miserably at -- the graphics are very easy on the eyes, which could make or break a game; the concept is simple and addictive (there are no trick levels or anything like that, just dance routines that you may need practice to pass accurately); and even though the tracks are all from the same artist, there actually is very little concern about the replay value dropping (something I was seriously worried about!), as there are so many catchy tracks that it's not even a question. It's a hard game, but in a great way - you're not ready to smash the controller, ever - and really, it's so balanced that it's going to be hard to beat as games go on. if they ever make a sequel sort of thing, we'll be one of the first lined up to grab it.",
        "rating": 10,
        "userid": 3,
        "gameid": 3
    },
    "119": {
        "urid": 119,
        "review": "This game is totally awesome in every way I love the dance moves they are so fun to perform",
        "rating": 10,
        "userid": 4,
        "gameid": 7
    },
    "120": {
        "urid": 120,
        "review": "its is the best workout ever you will workout with the dance move to unlock to go other moves my family had so much fun its a great family game.but you need to master the move to really get thru it each step lots of fun for partys.",
        "rating": 10,
        "userid": 6,
        "gameid": 1
    },
    "121": {
        "urid": 121,
        "review": "I could not wait for it i love his game its not like DDR or Just Dance its alot more workout with ur remote u have 2 whatch how he moves with his glove and u have 2 dance just like him im telling if u want a workout this is ur game right here it will make u sweat to death a fan or no fan lol",
        "rating": 8,
        "userid": 7,
        "gameid": 4
    },
    "122": {
        "urid": 122,
        "review": "this game is everything i wanted and more. It has all his great hits and famous moves. I had so much fun just singing along with the songs and feeling like i was making my own music video. If u like Michael Jackson you will like this game. As a MJ fan i recommend this to anyone. Yea it is made by the same ppl as just dance but i like it way better. you can choose to be either the back dancer, MJ, dance partner with their own difficulty. The dancing is not as easy as it looks sometimes and very fun. As for the background and graphics they are amazing very interesting its like being in the music video. I'm so addicted now",
        "rating": 10,
        "userid": 7,
        "gameid": 8
    },
    "123": {
        "urid": 123,
        "review": "Got the game on the day the preorder shipped, and I am thoroughly pleased with the game.\r\n\r\nIt plays well, albeit a bit too reliant on perfect motions, and really gets you into it.\r\n\r\nThe song selection is vast, and the entertainment value is high.\r\n\r\nYou get to pick whether you want to follow MJ's choreography, or the back up dancers, and it gives you a difficult for both.\r\n\r\nThe only real thing I didn't like about this game was it's lack of a tutorial. There is no way to learn how to play, other than simply playing. You catch on fast, but it would have been nice to have one.\r\n\r\nAll in all, the game is a good one, and I will be playing it for a long time, I'm sure.",
        "rating": 8,
        "userid": 3,
        "gameid": 9
    },
    "124": {
        "urid": 124,
        "review": "i like this game much i am a michael jackson fan and i pre-order the game i like so much guys you need to play this game",
        "rating": 10,
        "userid": 4,
        "gameid": 1
    },
    "125": {
        "urid": 125,
        "review": "This is a good fighter with a balanced combat system.  If you feel like Mortal Kombat is too gory for your kids, this is a great alternative.",
        "rating": 8,
        "userid": 3,
        "gameid": 3
    },
    "126": {
        "urid": 126,
        "review": "Great game with all the DLC. Love injustice a must buy.",
        "rating": 10,
        "userid": 3,
        "gameid": 4
    },
    "127": {
        "urid": 127,
        "review": "Good purchase, great gameplay, tricky controls as first",
        "rating": 8,
        "userid": 9,
        "gameid": 7
    },
    "128": {
        "urid": 128,
        "review": "It's like any other fighting game, just with dc characters.",
        "rating": 6,
        "userid": 4,
        "gameid": 2
    },
    "129": {
        "urid": 129,
        "review": "First time player, great game with good graphics and player selection.",
        "rating": 8,
        "userid": 6,
        "gameid": 3
    },
    "130": {
        "urid": 130,
        "review": "Anoher replacement game, love to play the multi player feature online and with family",
        "rating": 10,
        "userid": 7,
        "gameid": 9
    },
    "131": {
        "urid": 131,
        "review": "Has a learning curve, but doesn't stop it from being fun and addictive.",
        "rating": 8,
        "userid": 10,
        "gameid": 9
    },
    "132": {
        "urid": 132,
        "review": "I loved this game back when I had an Xbox 360. I sold it when I upgraded to an Xbox One not realizing it was backwards compatible. I just bought it again. I was addicted to Injustice 2, but wanted this one so I could play as Nightwing. Still fun!",
        "rating": 10,
        "userid": 8,
        "gameid": 7
    },
    "133": {
        "urid": 133,
        "review": "Not gonna lie, I'm no good at these games but it's still pretty awesome!",
        "rating": 8,
        "userid": 5,
        "gameid": 1
    },
    "134": {
        "urid": 134,
        "review": "I purchased this for my son & it never worked. I even tried it on another xbox. I would think you would check these games before selling, very unhappy!!",
        "rating": 2,
        "userid": 9,
        "gameid": 2
    },
    "135": {
        "urid": 135,
        "review": "Love the game..own 2nd version..wanted first version to play too",
        "rating": 10,
        "userid": 7,
        "gameid": 8
    },
    "136": {
        "urid": 136,
        "review": "it was the worst game in my entire life and the graphics didn't look to real",
        "rating": 2,
        "userid": 4,
        "gameid": 8
    },
    "137": {
        "urid": 137,
        "review": "Injustice Gods Among Us is from the people who bought everyone the one and only, Mortal Kombat series. this game is a lot like Mortal Kombat only with DC superheroes and villain's. every fighter is great in the game; it only depends who you like. the story mode is very deep, and exciting. plus the extra content is a bonus for the ultimate edition. overall great fighting game.",
        "rating": 10,
        "userid": 10,
        "gameid": 7
    },
    "138": {
        "urid": 138,
        "review": "I was going to buy the basic game, but took a chance and went for the Ultimate Edition. Really glad I did. The extra added characters and features makes it well worth the little extra. So many skill levels will entertain new players and old die hard fighter fans alike. Always great playing the DC heroes and the Baddies too. would recommend to anyone, thinking of buying the basic. You won't be sorry.",
        "rating": 10,
        "userid": 9,
        "gameid": 3
    },
    "139": {
        "urid": 139,
        "review": "I think it's a perfect game I love it and the best part is that the are making a second one on xbox one. One thing I think should be upgrade is the moves the should put a lot more power moves and stuff.Hope the second game is just as good.",
        "rating": 8,
        "userid": 7,
        "gameid": 10
    },
    "140": {
        "urid": 140,
        "review": "All in all not a bad game, tho is does have it's minor cons and let downs but like i said all in all not bad. Deff worth every penny.",
        "rating": 8,
        "userid": 2,
        "gameid": 2
    },
    "141": {
        "urid": 141,
        "review": "This game while very disappointing, is a very good game for new players to fighters. The game overall is a very fun game with a well balanced lineup of characters.",
        "rating": 8,
        "userid": 6,
        "gameid": 3
    },
    "142": {
        "urid": 142,
        "review": "3 words. best graphics ever.if this was a shooter game it would notbe argued about with battlefield fans and COD fans. Besides, the fact that the regular game has awesome characters, really really awesome including 6 new characters! awesome!!!!!!!!!!!!!!!! and i would slightly violent i would not recommend for 7 to 9 year olds. but seriously. the fact that you can pla on mobile devices is awesome. INJUSTICE: GODS AMONG US Regular Edition is awesome 3 on 3 combatics is awesome. darkseid is awesome superman is awesome BATMAN IS AWESOME!!!!!!!!!!!!!!!!!!!! would totally recommend.",
        "rating": 10,
        "userid": 8,
        "gameid": 9
    },
    "143": {
        "urid": 143,
        "review": "This game was awesome I love it. It's so exciting to fight against villains and superheroes. My xbox 360 broke so I'm getting an xbox one. Hope it runs smooth on the new system",
        "rating": 10,
        "userid": 6,
        "gameid": 8
    },
    "144": {
        "urid": 144,
        "review": "Wow...that is all I can say. Forget about eating, sleeping and cleaning the gutters because this is all you will be doing for, like, ever. You can be Super Heroes and stuff and also the bogus bad guys that try and cramp their style. Oh, and there are like, locations from the comics that you fight in and stuff. Scorpion from Mortal Kombat is along for the ride too because it's freaking Scorpion. If you liked Hello Kitty's Island Adventure you will absolutely LOVE this freaking game. Grilled Cheese is a good lunch.",
        "rating": 10,
        "userid": 9,
        "gameid": 9
    },
    "145": {
        "urid": 145,
        "review": "AWESOME !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
        "rating": 10,
        "userid": 3,
        "gameid": 6
    },
    "146": {
        "urid": 146,
        "review": "Injustice gods among us is a good but not great game, however there is a Scropian DlC so it kind of makes me want to pick it as I've only played the demo.",
        "rating": 8,
        "userid": 3,
        "gameid": 3
    },
    "147": {
        "urid": 147,
        "review": "People who love street fight, tekkan, & Mortal Combat I would highly suggest at least taking a look at the game",
        "rating": 8,
        "userid": 3,
        "gameid": 6
    },
    "148": {
        "urid": 148,
        "review": "I think it was an awesome idea for this game but some characters i think could have been better like bane could have been the newest bane or for a DLC most people like the dark night rises bane but they could have added different characters like killer croc, beast boy,or something like that but the original copy was a great game i never played this copy but from what I've played the game is awesome and i think nether realm and DC should keep working together",
        "rating": 10,
        "userid": 4,
        "gameid": 7
    },
    "149": {
        "urid": 149,
        "review": "This is one of those games where we wait for it to come out and it meets our standards at most points. It has good graphics great voice acting the action can be amazing at times and lackluster at others, in my opinion it gets pretty repetative during the 4 hour story mode and the star lab missions can be downright frustrating at times with no real incentive to keep at them. Multiplayer is where this game shines it is great fun to take on your friends andd settle those lifelong debates like wwho would win between batman and aquaman. all in all this is a good game but had just a few issues that kept it from being great",
        "rating": 8,
        "userid": 7,
        "gameid": 10
    },
    "150": {
        "urid": 150,
        "review": "I have this game before in xbox 360, but right now I have I xbox one and this game is only for xbox 360, ps3,ps4. please make this game to xbox one. I know there are people who like this game. hardcore gamers! thanks.",
        "rating": 4,
        "userid": 4,
        "gameid": 3
    },
    "220403150524": {
        "urid": "220403150524",
        "review": "I just love the game. graphics. game play. everything is just awesome.",
        "rating": "10",
        "userid": 1,
        "gameid": "4"
    }
}